{
  "CHEST-CROSSES": "The starting position sees the athlete lying on his back on a flat bench with buttocks, upper back, shoulder blades and nape always in contact with it and with the feet firmly resting on the ground vertically below or behind the knees, but never in front. The hips are abducted and the lower limbs push on the floor in a balanced way to ensure stability to the position. The flexors of the spine are in the elongated position, but in isometric contraction, while the extensors are in shortening; both work in balance to ensure continuity between the lower and upper limbs. The shoulder blades are adducted, neither depressed nor elevated. The shoulders are extended in a hybrid plane between the transverse and the sagittal ones, while the elbows are almost completely extended. The handlebars are held firmly using the thumb and the wrists are in a neutral or slightly flexed position. The execution consists of flexing the shoulders so that each dumbbell traces an arc of a circle on the transverse plane on which it lay at the start. The movement ends just before the dumbbells are perpendicular to the ground.",
  "SQUAT": "For a safer and more effective squat it is important to respect the following execution technique:Contract your abs and push your legs upwards;Place the heels slightly wider than the shoulders, taking care to rotate the toes outwards by about 30 °;Move the pelvis back slightly, tensing the hamstrings; slowly bend your legs going down, without letting yourself fall but keeping the muscles in tension and avoiding lateral movements of the knees;Go down until the thighs are parallel to the ground or, if you prefer, until the hip joint is at the same height as the knee;Just before reaching the maximum flexion position, start to slow down the movement more preparing yourself for the ascent;Once this position is reached, push hard on the heels straightening the legs but without fully extending the knees;During the ascent, the thigh muscles must be actively contracted so that the lower limbs do not perform dangerous oscillatory movements.",
  "BENCH-PRESS": "The starting position sees the athlete lie down with his back on the flat bench and keep his head, shoulders and buttocks in contact with the bench; feet must remain flat on the ground; your hands should grasp the barbell tightening the grip. Once the barbell has been removed and lifted from the rack, the athlete positions himself with his arms outstretched and elbows locked; the exercise starts by moving the arm towards the arm, making the barbell go down parallel to your chest up to the chest near the sternum, the ascent phase requires thenathlete to lift the bar and return to the starting position with arms extended and elbows tightened.",
  "DEADLIFTS": "The starting position sees the athlete in partial squat with the barbell attached to the shins. The opening angle of the feet should be approximately 10 °. The shoulder blades are adducted. Knees and hips are bent just enough to allow your hands to grasp the bar. The execution consists in simultaneously starting to extend the spine, hips, knees and to perform a plantar flexion, paying attention to the shoulders which must be a few centimeters ahead of the bar from a lateral view at the start. To lighten the load on the spine, during the movement of the barbell, it must be kept attached to the body thanks to an extension of the shoulder. Pay particular attention not to bring the knees together, which must remain aligned with the feet throughout the movement.",
  "PULL-UP": "The starting position sees the athlete hanging from the bar with arms width approximately equal to the widthshoulders, contracted abdomen and abducted shoulder blades. From this position, with your arms fully extended,you try to bring your chest up until it touches the bar. The movement is thus complete, phase of descent with return to the slow and controlled starting position.",
  "ROW": "The starting position sees the athlete with the barbell at his feet, with the knees slightly bent and the distance between the feet slightly greater than that of the shoulders. He bends his back in such a way to make it almost parallel to the ground. With the back contracted and arched and the shoulder blades adducted (close together) the barbell is grasped with a prone or supine grip as wide as the shoulders. The arms are outstretched. The barbell is raised until it is in contact with the torso, moving only the arms and holding the elbows along the hips. You are for a moment in the phase of maximum contraction of the lats, then lower the bar with a slow and controlled movement without moving other parts of the body."
}